<PAD>
<START>
<EOS>
<UNK>
the
.
a
you
on
right
and
,
left
your
to
intersection
with
turn
of
go
at
next
will
traffic
be
there
is
in
straight
see
building
that
'
this
street
red
down
are
so
should
stop
first
forward
white
green
it
road
blue
through
take
light
until
flow
yourself
side
pass
scaffolding
when
way
just
awning
sign
ll
ahead
walk
make
as
going
one
an
continue
black
past
orange
-
yellow
then
front
move
before
direction
after
orient
again
two
now
have
construction
follow
re
reach
head
another
brick
block
up
store
keep
some
look
come
corner
facing
get
end
large
moving
same
into
has
second
fence
door
face
for
wall
around
awnings
)
small
passing
middle
parked
where
(
from
windows
bridge
can
crosswalk
cars
barriers
but
all
s
signs
sidewalk
parking
long
truck
letters
once
trees
short
proceed
under
park
three
behind
brown
doors
by
3
gray
area
fire
pole
bright
lane
walking
between
bikes
lot
align
over
top
/
hydrant
here
if
row
out
bus
position
both
back
very
buildings
glass
painted
flag
enter
bike
shop
little
bit
t
start
across
directly
trash
above
median
them
almost
metal
sides
stand
distance
against
big
2
playground
near
cones
silver
flags
following
step
four
towards
fenced
narrow
which
lights
storefront
immediately
garage
tree
intersections
please
more
window
lettering
travel
entrance
soon
steps
dark
grey
purple
close
dumpster
looking
standing
box
4
along
not
third
last
hand
other
food
point
also
colored
about
do
tall
fencing
starting
graffiti
barrier
striped
hanging
toward
van
slightly
still
business
cross
tunnel
few
post
stone
rotate
open
turning
well
shortly
pink
heading
square
off
further
tan
notice
mailbox
want
poles
even
car
banner
nearest
correct
begin
canopy
like
line
iron
these
covered
onto
need
walls
chain
halfway
don
american
while
set
far
stripe
gold
ends
concrete
colorful
cone
several
umbrellas
or
plants
link
made
its
stay
turned
overpass
couple
restaurant
only
newspaper
shaped
basketball
gate
arrow
ignore
bunch
lots
boxes
cart
find
passed
away
diamond
keeping
mural
barrels
time
arched
writing
eye
ve
logo
bags
rental
delivery
outside
garbage
those
;
wooden
either
till
no
court
approach
sure
1
bottom
path
stopping
arrive
veer
stairs
ways
flowers
stripes
eventually
neon
school
overhang
double
barricades
pillars
stoplight
potted
center
pedestrian
planters
coming
closest
half
section
exit
hello
empty
opposite
circle
benches
reaching
option
curve
columns
ramp
courts
put
place
bicycles
trim
followed
band
subway
umbrella
making
able
beige
phone
crossing
round
looks
final
ground
oncoming
bicycle
pile
entering
each
watch
posts
arch
tarp
floor
1st
huge
booth
u
!
too
billboard
arrows
part
walkway
ladder
cement
opportunity
mailboxes
turns
banners
doorway
immediate
single
many
water
buses
hit
curves
bushes
people
mail
church
main
rectangular
bench
stores
fork
text
bricks
came
smaller
inside
wide
arches
chairs
traveling
escape
5
nearby
blocks
closed
below
cans
dead
they
wood
tables
beyond
vertical
opening
beside
underneath
maroon
sitting
what
reorient
fences
suv
planter
k
bank
vehicles
trashcan
such
started
"
grassy
different
trucks
getting
sticking
lanes
leading
man
bin
archway
bollards
flower
destination
than
outdoor
field
apartment
color
goes
giant
vendor
lines
watching
leaning
lit
won
chance
story
thru
yet
structure
plant
though
seating
background
know
rainbow
station
poster
may
alley
dumpsters
gates
grass
lined
numbers
posters
barrel
curb
covering
surrounded
split
. (
overhead
motorcycle
dog
vehicle
rack
bins
most
paper
headed
lamppost
work
encounter
full
edge
beginning
jutting
name
roof
wrought
racks
letter
completely
hang
slow
reddish
shops
piece
painting
space
3rd
upcoming
escapes
were
their
paint
low
any
coffee
circular
entry
netting
cream
wrong
multiple
picture
taxi
being
hot
without
statue
divider
bear
rounded
track
island
highway
security
woman
puts
spot
parallel
base
storefronts
:
starts
rectangle
travelling
octagon
olive
quite
attention
clock
tricky
trailer
strip
circles
pictures
driving
high
slight
mostly
upon
curved
railing
lamp
roll
gap
divided
awing
barely
level
touchdown
gone
accents
mesh
market
staring
bag
pipe
fourth
ignoring
try
2nd
leave
bars
degrees
shelter
ones
quick
cover
note
appears
wire
air
framed
forwards
shape
police
drive
plywood
cobblestone
fancy
chinese
carts
site
break
choice
zone
theater
shrubs
crosswalks
finally
faded
temporary
longer
loading
stands
play
much
triangle
characters
pots
barricade
pointing
instead
entrances
rows
symbols
gated
merge
tiny
planted
fruit
lighted
..
symbol
ornate
jersey
sort
star
equipment
weird
trimmed
diagonal
things
burgundy
horizontal
speed
series
sets
steel
squares
continuing
dividers
quickly
figures
larger
boards
awhile
surrounding
plastic
view
boarded
bump
y
clear
enough
frame
closer
visible
new
driveway
cap
splits
house
paying
panels
heart
actually
order
stick
lower
balconies
holding
underground
sale
vans
lining
cafe
number
potty
chained
column
triangular
christmas
meter
thin
corners
90
signage
proper
attached
garden
comes
machine
advertisement
multi
exactly
really
fronts
kind
6
upper
sections
glyphs
sculpture
reached
staircase
mannequins
angled
words
possible
hard
sports
streets
board
baseball
border
blocking
leaving
roads
taking
national
approaching
doorways
pattern
person
pipes
elevated
pharmacy
cylinders
art
thing
port
pizza
type
basically
gas
grocery
entryway
clothing
multicolored
run
cab
reorienting
golden
statues
urn
backwards
major
darker
pretty
porta
appear
lime
verify
retaining
pair
similar
beneath
skinny
skip
teal
places
patch
curvy
tape
framing
raised
various
we
check
surface
leaves
stays
tent
manhole
tents
brownish
sharp
stars
produce
bar
facade
clothes
meets
scaffolds
basket
lawn
floors
eyes
sedan
tied
soccer
farther
doing
bells
areas
plaza
yard
navy
dimensional
chainlink
feet
nearly
postal
must
bell
solid
begins
good
use
greenery
overhangs
dirty
change
lighter
paces
extending
roadway
ice
given
diagonally
conditioner
locked
directions
entire
electronic
meet
crane
wider
design
length
click
blocked
situated
midway
shift
word
revolving
advertisements
slowly
bridges
available
bend
correctly
bay
running
old
marquee
plain
shopping
whole
thereafter
vendors
style
busy
oval
hedges
five
decorated
panel
city
shiny
bldg
ad
murals
asphalt
slanted
shuttered
target
ball
shutters
trashcans
stuff
seeing
aforementioned
safety
grayish
colors
us
signal
modern
wearing
pillar
might
trashbags
unloading
pointed
our
stairway
hat
billboards
positioning
underpass
decorative
pumpkins
wrap
exiting
logos
choose
fairly
bush
courtyard
brightly
stretch
hotel
flanked
cardboard
blockades
alongside
hexagon
materials
motorcycles
wraps
image
having
artwork
putting
staying
anymore
narrower
together
route
walled
markings
junction
seat
scaffold
equal
staircases
wheels
service
selling
grate
lid
dots
lion
group
deli
would
topped
d
navigation
showing
dirt
tops
ton
faces
treed
table
freeway
display
fully
growing
her
]
body
held
cup
foot
ensure
portion
nearing
less
because
globe
read
designs
container
outlined
done
payphone
shapes
rear
river
haven
dining
dividing
pay
pickup
juts
nice
flowing
tractor
greenish
crossed
diner
apple
animal
medium
docks
apartments
been
however
pub
sidewalks
stepping
ladders
headlights
takes
guard
containers
written
ivy
identical
pot
scooter
object
chimney
movie
paved
streetlight
recycling
was
leads
stoop
careful
domed
smoke
structures
properly
v
turquoise
goal
diamonds
alternating
inset
steam
isn
he
hill
went
maybe
glowing
partway
sandwich
figure
rentals
roughly
borders
asian
pale
shipping
potties
tipped
balloons
something
semi
yellowish
wheel
leaf
pallets
guy
atm
. [
stacked
chair
offramp
tower
residential
guardrail
could
moped
dome
stripped
kids
canopies
follows
had
extends
booths
’
mirrored
someone
connected
instantly
bronze
waiting
items
wrapped
alleyway
machinery
oriented
paid
curving
real
map
count
flows
regular
dispenser
rather
stops
stack
quarters
4th
men
got
tile
company
higher
bird
frames
covers
canvas
thick
rectangles
tennis
railings
spaces
rails
merging
hats
jog
human
clearly
via
aligned
complete
remain
glasses
zebra
times
scaffholding
chalkboard
camera
built
flatbed
archways
theres
home
rent
balls
supports
orientate
does
reflective
x
beam
flat
heavy
advertising
shrubbery
forks
options
forced
ish
bare
public
accent
previous
suspension
tons
rusted
angle
enclosure
smooth
tiles
cylinder
bent
trunk
bays
caution
confusing
join
minivan
i
character
dock
let
rise
decoration
easy
pylons
runs
odd
grates
bricked
stacks
kiosk
taxis
sky
mark
hydrants
hole
connecting
stretches
saw
broken
razor
pastraight
six
later
perpendicular
cannot
rocks
patterned
spots
veering
sideways
lady
filled
every
strips
did
dump
decorations
m
cartoon
tip
wavy
signpost
gothic
actual
strange
rat
swoosh
unit
caps
tarps
landmarks
exterior
news
bluish
handball
carved
partially
changes
youll
taped
dual
seem
conditioners
support
tire
stair
controls
downward
roofs
direct
dot
images
lettered
afterwards
interface
branches
fresh
bases
palm
shirt
rollup
fedex
lookout
busses
cargo
noticeable
balcony
skyline
emblem
rot
cloth
shopfront
backup
clover
parks
sidestep
ornaments
rights
carrier
o
pas
pine
affixed
eating
skyscraper
vegetables
tad
access
says
pavement
bowling
yes
supermarket
squared
pedestrians
doesn
location
convenience
buggy
rest
beams
everything
female
patio
drawing
show
vibrant
magazine
divide
sticker
miss
within
backed
lanterns
&
mirrors
?
lighting
barbed
shorter
skyway
enclosed
brighter
prior
plates
me
handle
vacant
coat
interesting
veers
flight
keeps
older
3d
rod
windowed
marquees
carriage
scene
limo
using
triangles
crowded
hardware
currently
anywhere
bed
original
drums
card
metallic
spire
branch
piles
children
supported
paintings
cage
pumpkin
always
non
flagpole
riding
ability
pieces
toned
crown
hanger
form
itself
. .
disappear
sport
grid
ribbon
curtains
plantings
foliage
lets
stickers
bigger
parts
opportunities
bottles
size
bollard
telephone
pig
chicken
mirror
faux
islands
aren
lefts
gift
ambulance
surroundings
levels
rust
plate
land
purplish
bust
blank
beer
lead
fabric
homes
180
shy
fair
aqua
bubble
ready
letting
barred
overgrown
storage
marking
vertically
probably
extra
rotating
warning
bring
limit
normal
vent
capped
yo
alcove
picket
furthest
amount
fifth
backs
tun
lids
posted
although
siding
barber
st
e
ave
w
avenue
northwest
southeast
west
houston
pl
broadway
6th
southwest
south
northeast
north
7th
5th
14th
grand
greenwich
10th
east
hudson
delancey
bowery
washington
canal
8th
fdr
dr
11th
c
varick
12th
20th
9th
broome
lafayette
bleecker
13th
allen
b
18th
17th
loisaida
spring
becomes
n
15th
essex
21st
19th
madison
clinton
23rd
pearl
16th
rivington
centre
pitt
duane
reade
chrystie
stanton
pike
prince
mercer
manhattan
union
mott
ln
slip
mulberry
battery
22nd
forsyth
capital
26th
cooper
fulton
university
sq
waverly
christopher
chambers
irving
charles
hester
greene
montgomery
macdougal
chase
ludlow
clarkson
25th
perry
william
maiden
elizabeth
state
kenmare
eldridge
thompson
lexington
watts
williamsburg
samuel
dickstein
loop
. /
henry
orchard
franklin
murray
starbucks
marks
jane
24th
sullivan
gramercy
suffolk
norfolk
barrow
crosby
wooster
ridge
columbia
morton
america
financial
bedford
laguardia
rutgers
john
moore
horatio
jones
worth
abingdon
walker
leroy
leonard
division
chipotle
mexican
grill
great
carmine
baxter
28th
broad
king
james
barclay
liberty
charlton
chatham
27th
brooklyn
warren
cherry
wanamaker
cortlandt
trinity
viaduct
catherine
restaurants
f
baruch
grove
laight
30th
gansevoort
vestry
beach
7
beekman
bayard
holland
jackson
stuyvesant
oliver
br
vesey
cleveland
italy
attorney
thomas
sheridan
hubert
thames
roosevelt
gouverneur
bond
verizon
authorized
retailer
–
victra
bethune
howard
willett
citibank
rector
29th
vandam
downing
jefferson
hanover
harrison
78
nassau
robert
wagner
sr
frankfort
foley
r
peck
mcdonald
rd
lukes
morris
monroe
minetta
ann
eleven
whitehall
td
hogan
village
astor
albany
nathan
perlman
healthy
rutherford
spruce
gnc
york
ferry
desbrosses
popbar
dey
governors
canyon
heroes
stonewall
31st
pure
commerce
mangin
cedar
lispenard
23
lewis
hsbc
fletcher
reference
rte
907l
fairway
chelsea
dover
dominick
szold
beaver
33rd
greenway
mt
carmel
cornelia
renwick
father
damian
sheriff
terrace
34th
cliff
gouvernour
luxeye
optical
abraham
kazan
9a
platt
lillian
wald
federal
pell
wells
fargo
jay
coenties
taras
shevchenko
dutch
elk
asser
levy
478
numero
28
pizzeria
pk
ericsson
exchange
peter
frank
modica
mechanics
32nd
schwartz
edgar
collister
10
signature
.  (
johns
waterside
strongest
legion
memorial
queen
airport
cobblehill
staple
trimble
278
carlisle
civic
benson
weehawken
mosco
e20
e23
interstate
minuit
bernard
steve
flanders
loans
simpsons
gay
malls
straus
mews
ny
mill
rose
ryders
doyers
ct
kennedy
promenade
35th
joseph
p
ward
finest
patchin
milligan
uptown
downtown
municipal
saint
andrews
hugh
l
carey
urban
theatre
edens
freeman
world
trade
tribeca
esplanade
pace
bloomfield
triboro
bikeway
cannon
16
8
hall
495
34
midtown
marketfield